# -*- coding: utf-8 -*-
from Products.Five.browser import BrowserView
from Products.Five.browser.pagetemplatefile import ViewPageTemplateFile
from plone import api
from Products.CMFPlone.utils import safe_unicode
import json
import logging

logger = logging.getLogger('crgis.theme')
LIMIT=20

areaNames = '''[
["新北市", ["板橋區", "三重區", "中和區", "新莊區", "新店區", "樹林區", "鶯歌區", "三峽區", "淡水區", "汐止區", "瑞芳區", "土城區", "蘆洲區", "五股區", "泰山區", "林口區", "深坑區", "石碇區", "三芝區", "石門區", "八里區", "平溪區", "雙溪區", "金山區", "萬里區", "烏來區"]],
["基隆市", ["中正區", "七堵區", "暖暖區", "仁愛區", "中山區", "安樂區", "信義區"]],
["臺北市", ["中正區", "大同區", "松山區", "大安區", "萬華區", "信義區", "士林區", "北投區", "內湖區", "文山區", "南港區", "中山區"]],
["桃園市", ["桃園區", "中壢區", "平鎮區", "八德區", "楊梅區", "蘆竹區", "大溪區", "龍潭區", "龜山區", "大園區", "觀音區", "新屋區", "復興區"]],
["新竹縣", ["竹北市", "竹東鎮", "新埔鎮", "關西鎮", "湖口鄉", "新豐鄉", "峨眉鄉", "寶山鄉", "北埔鄉", "芎林鄉", "橫山鄉", "尖石鄉", "五峰鄉"]],
["新竹市", ["東區", "北區", "香山區"]],
["苗栗縣", ["苗栗市", "頭份市", "竹南鎮", "後龍鎮", "通霄鎮", "苑裡鎮", "卓蘭鎮", "造橋鄉", "西湖鄉", "頭屋鄉", "公館鄉", "銅鑼鄉", "三義鄉", "大湖鄉", "獅潭鄉", "三灣鄉", "南庄鄉", "泰安鄉"]],
["臺中市", ["中區", "東區", "南區", "西區", "北區", "北屯區", "西屯區", "南屯區", "太平區", "大里區", "霧峰區", "烏日區", "豐原區", "后里區", "石岡區", "東勢區", "新社區", "潭子區", "大雅區", "神岡區", "大肚區", "沙鹿區", "龍井區", "梧棲區", "清水區", "大甲區", "外埔區", "大安區", "和平區"]],
["南投縣", ["南投市", "埔里鎮", "草屯鎮", "竹山鎮", "集集鎮", "名間鄉", "鹿谷鄉", "中寮鄉", "魚池鄉", "國姓鄉", "水里鄉", "信義鄉", "仁愛鄉"]],
["彰化縣", ["彰化市", "員林市", "和美鎮", "鹿港鎮", "溪湖鎮", "二林鎮", "田中鎮", "北斗鎮", "花壇鄉", "芬園鄉", "大村鄉", "永靖鄉", "伸港鄉", "線西鄉", "福興鄉", "秀水鄉", "埔心鄉", "埔鹽鄉", "大城鄉", "芳苑鄉", "竹塘鄉", "社頭鄉", "二水鄉", "田尾鄉", "埤頭鄉", "溪州鄉"]],
["雲林縣", ["斗六市", "斗南鎮", "虎尾鎮", "西螺鎮", "土庫鎮", "北港鎮", "林內鄉", "古坑鄉", "大埤鄉", "莿桐鄉", "褒忠鄉", "二崙鄉", "崙背鄉", "麥寮鄉", "臺西鄉", "東勢鄉", "元長鄉", "四湖鄉", "口湖鄉", "水林鄉"]],
["嘉義市", ["東區", "西區"]],
["嘉義縣", ["太保市", "朴子市", "布袋鎮", "大林鎮", "民雄鄉", "溪口鄉", "新港鄉", "六腳鄉", "東石鄉", "義竹鄉", "鹿草鄉", "水上鄉", "中埔鄉", "竹崎鄉", "梅山鄉", "番路鄉", "大埔鄉", "阿里山鄉"]],
["臺南市", ["中西區", "東區", "南區", "北區", "安平區", "安南區", "永康區", "歸仁區", "新化區", "左鎮區", "玉井區", "楠西區", "南化區", "仁德區", "關廟區", "龍崎區", "官田區", "麻豆區", "佳里區", "西港區", "七股區", "將軍區", "學甲區", "北門區", "新營區", "後壁區", "白河區", "東山區", "六甲區", "下營區", "柳營區", "鹽水區", "善化區", "大內區", "山上區", "新市區", "安定區"]],
["高雄市", ["楠梓區", "左營區", "鼓山區", "三民區", "鹽埕區", "前金區", "新興區", "苓雅區", "前鎮區", "旗津區", "小港區", "鳳山區", "大寮區", "鳥松區", "林園區", "仁武區", "大樹區", "大社區", "岡山區", "路竹區", "橋頭區", "梓官區", "彌陀區", "永安區", "燕巢區", "田寮區", "阿蓮區", "茄萣區", "湖內區", "旗山區", "美濃區", "內門區", "杉林區", "甲仙區", "六龜區", "茂林區", "桃源區", "那瑪夏區"]],
["屏東縣", ["屏東市", "潮州鎮", "東港鎮", "恆春鎮", "萬丹鄉", "長治鄉", "麟洛鄉", "九如鄉", "里港鄉", "鹽埔鄉", "高樹鄉", "萬巒鄉", "內埔鄉", "竹田鄉", "新埤鄉", "枋寮鄉", "新園鄉", "崁頂鄉", "林邊鄉", "南州鄉", "佳冬鄉", "琉球鄉", "車城鄉", "滿州鄉", "枋山鄉", "霧臺鄉", "瑪家鄉", "泰武鄉", "來義鄉", "春日鄉", "獅子鄉", "牡丹鄉", "三地門鄉"]],
["宜蘭縣", ["宜蘭市", "頭城鎮", "羅東鎮", "蘇澳鎮", "礁溪鄉", "壯圍鄉", "員山鄉", "冬山鄉", "五結鄉", "三星鄉", "大同鄉", "南澳鄉"]],
["花蓮縣", ["花蓮市", "鳳林鎮", "玉里鎮", "新城鄉", "吉安鄉", "壽豐鄉", "光復鄉", "豐濱鄉", "瑞穗鄉", "富里鄉", "秀林鄉", "萬榮鄉", "卓溪鄉"]],
["臺東縣", ["臺東市", "成功鎮", "關山鎮", "長濱鄉", "池上鄉", "東河鄉", "鹿野鄉", "卑南鄉", "大武鄉", "綠島鄉", "太麻里鄉", "海端鄉", "延平鄉", "金峰鄉", "達仁鄉", "蘭嶼鄉"]],
["澎湖縣", ["馬公市", "湖西鄉", "白沙鄉", "西嶼鄉", "望安鄉", "七美鄉"]],
["連江縣", ["南竿鄉", "北竿鄉", "莒光鄉", "東引鄉"]],
["金門縣", ["金城鎮", "金湖鎮", "金沙鎮", "金寧鄉", "烈嶼鄉", "烏坵鄉"]]
]'''
wgyeNames = '''[
["單姓王爺", ["李府", "池府", "吳府", "朱府", "范府", "趙府", "林府", "武府", "蕭府", "蘇府", "蔡府", "厲府", "遊府", "遊府", "賈府", "姚府", "余府", "倪府", "清府", "謝府", "王府", "澤府", "岳府", "韓府", "章府", "陳府", "何府", "耿府", "封府", "譚府", "葉府", "知府", "方府", "張府", "溫府", "邢府", "馬府", "康府", "金府", "雷府", "楊府", "黃府", "丁府", "薛府", "白府", "嚴府", "尹府", "許府", "程府", "莫府", "南府", "包府", "魏府", "徐府", "龍府", "伍府", "侯府", "盧府", "羅府", "邱府", "梁府", "秦府", "施府", "郝府", "蔣府", "仰府", "高府", "潭府", "針府", "洪府", "和府", "游府", "周府", "巡府", "高府", "連府", "雲府", "戴府", "浦府", "淵府", "蓁府", "酈府", "錢府", "柴府", "魯府", "狩府", "袁府", "守府", "斐府", "夏府", "龐府", "黑府", "玉府", "貳府", "留府", "森府", "國府", "田府", "董府", "鍊府", "狄府", "鳳府", "匡府", "鐵府", "耿府", "欽府", "天府", "沈府", "赫府", "註府", "紂府", "曹府", "呂府", "顏府", "辛府", "刑府", "諸府", "尋府", "柳府", "鍾府", "巫府", "柑府", "淡府", "殷府", "夔府", "佟府", "舜府", "萬府", "譚府", "抄府"]],
["封號王爺", ["羅周府", "金順府", "黃欽府", "十三府遊天王", "義愛公", "隨駕王爺", "十六神千歲大眾千歲", "田島千歲", "二府王爺"]],
["特殊王爺", ["白水三王爺", "松府", "石府", "康天千歲", "苓府", "白府代天巡狩", "溪州王爺", "玉王千歲", "玉地前鋒千歲"]],
["二府千歲", ["鄭經", "鄭瑞、鄭發", "鄭成功、鄭經"]],
["三府千歲", ["章趙羅", "張李莫", "李朱池", "朱邢李", "李天池", "朱曹魏", "葉朱李", "朱雷殷", "蘇康池", "欽魏蕭", "塩糖池", "雷溫蘇", "蕭潘郭", "邱吳溫", "彭林凌", "蘇李池", "梁朱林", "朱池伍", "朱雷池", "金林嚴", "薛邢李"]],
["四府千歲", ["蕭刑沈廉", "蕭蕭邢委", "刑王朱沈", "邱吳溫周", "雷朱薛刑", "李邢林章", "薛李池朱"]],
["五府千歲", ["李池吳朱范", "蘇邱梁秦蔡", "紀尤溫答李", "朱刑李池范", "朱刑李金林", "李練吳金保生", "周欽吳沈丁", "張李莫馬池", "李吳馬朱羅", "李池吳張鄭", "李林張池吳", "吳溫雷占(邢)王", "李池吳朱盧", "池秦吳丁太子", "李池番朱溫", "朱李池抄吳", "李池吳朱丁", "朱康池張潘", "李馬朱邢舜", "朱莫李張吳", "張許雷南李", "池邢金何馬", "朱岳紀金伍", "李范邢朱林", "李池吳范金", "李池吳魏邢", "李吳邢朱范", "張李莫雷白", "紀范雷白伍", "蘇邱梁秦蔡", "朱李池蘇秦", "池朱蘇薛諸"]],
["六府千歲", ["順欽黃朱張十三", "陳韋溫金駱蘇", "順欽黄朱李温", "溫許薛朱黃蘇", "順十三范楊丁雷", "李池吳朱范張"]],
["七府千歲", ["龍天張劉沈蘇林", "章韓雷狄邢金池", "紀范吳李池溫刑", "張許雷南李賈姚", "朱吳李林范睦遊", "蕭蘇邢沈羅池朱", "張陳池伍孫郭順", "金天由劉池沈趙", "龍天劉沈林蘇張"]],
["九府千歲", ["鄧金龐紀凌唐姬王袁"]],
["十二瘟王、五年千歲", ["張徐侯耿吳何薛封趙譚盧羅", "張余侯耿吳何薛封趙譚盧羅", "李太子包白葉伍方薛知武盧羅侯", "侯金白包武葉徐盧薛羅花方順李池", "魏蕭雷羅吳張趙封侯薛耿盧徐何譚", "紀李吳池范朱金馬溫殷楊于"]]
]'''


class WangyeQuery(BrowserView):

    def __call__(self):
        context = self.context
        request = self.request
        portal = api.portal.get()

        catalog = context.portal_catalog

        area2 = request.form.get('area2[]')
        wynm = request.form.get('wynm[]')
        start, end = request.form.get('yearRange').split(',')
        hostcmpn = request.form.get('hostcmpn[]')
        subject = request.form.get('subject[]')

        query = {'portal_type': 'Temple', 'sort_on': 'getId', 'deity': '\xe7\x8e\x8b\xe7\x88\xba'}

        if (not area2) and (not wynm) and (not hostcmpn) and (not subject):
            return None

        if area2:
            query['area2'] = area2
        if wynm:
            query['wynm'] = wynm
        if hostcmpn:
            query['hostcmpn'] = hostcmpn
        if subject:
            query['Subject'] = subject

        # founded 
        founded = [int(start), int(end)]
        range = 'min:max'
        """
            elif start and not end:
                founded = start
                range = 'min'
            else:
                founded = end
                range = 'max' """
        query['founded'] = {'query': founded, 'range': range}

        brains = catalog(query)
        result = []
        for brain in brains:
            item = brain.getObject()
            founded = ''
            if item.getEra():
                founded = founded + item.getEra() + '\xe5\x89\xb5\xe5\xbb\xba'
            hostcmpn = ''
            if 'deity_001' in item.getDeity_host() or '\xe7\x8e\x8b\xe7\x88\xba' in item.getDeity_host():
                hostcmpn += '\xe4\xb8\xbb\xe7\xa5\x80'
            if 'deity_001' in item.getDeity_company() or '\xe7\x8e\x8b\xe7\x88\xba' in item.getDeity_company():
                hostcmpn += '\xe9\x99\xaa\xe7\xa5\x80'
            wysm = ''
            if item.getWysm():
                wysm += item.getWysm()

            if brain.zgeo_geometry.get('coordinates', None):
                lat = float(brain.zgeo_geometry.get('coordinates')[1])
                lng = float(brain.zgeo_geometry.get('coordinates')[0])
                latlng = [lat, lng]
            else:
                latlng = [0, 0]

            result.append({'latlng': latlng, 'title': brain.Title, 'url': brain.getURL(), 'area1': item.__parent__.__parent__.Title(), 'area2': item.__parent__.Title(), 'founded': founded, 'hostcmpn': hostcmpn, 'wysm': wysm})
        return json.dumps(result)


class FilterMap(BrowserView):

    template = ViewPageTemplateFile("wgye_filter.pt")

    def __call__(self):
        context = self.context
        request = self.request
        portal = api.portal.get()
        self.countyNames = json.loads(areaNames)
        self.wangYeFamilyName = json.loads(wgyeNames)

        return self.template()
